app/views/users/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 11]]
---

    <% if @user.questions.first != nil %>