app/controllers/answers_controller.rb

INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Kraft is gummy"], ["user_id", 13], ["question_id", 11], ["created_at", "2015-02-12 16:10:33.988599"], ["updated_at", "2015-02-12 16:10:33.988599"]]
---
  def create
    @answer = Answer.new(answer_params)
    current_user.answers << @answer

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 11]]
---
    def set_question
      @question = Question.find(params[:question_id])