app/controllers/comments_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 21]]
---
  def new
    @comment = Comment.new
    @answer = Answer.find(params[:commentable_id])

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 21]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Meta comment"], ["user_id", 13], ["created_at", "2015-02-12 16:11:18.533025"], ["updated_at", "2015-02-12 16:11:18.533025"]]
---
  def create
    @comment = Comment.new(comment_params)
    @answer = Answer.find(params[:commentable_id])
    current_user.comments << @comment