app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def create
    question = Question.create(question_params)
---
INSERT INTO "questions" ("title", "prompt", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Kraft or ronzoni"], ["prompt", "you know the big two!"], ["user_id", 13], ["created_at", "2015-02-12 16:09:43.348168"], ["updated_at", "2015-02-12 16:09:43.348168"]]

  def update
    @question.update!(question_params)
---
UPDATE "questions" SET "prompt" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["prompt", "You know the big two!"], ["updated_at", "2015-02-12 16:10:25.161285"], ["id", 11]]

    def set_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 11]]