app/controllers/sessions_controller.rb

  def create
    user = User.all.find do |u|
---
SELECT "users".* FROM "users"