app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

UPDATE "users" SET "name" = $1, "pic_url" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Mr. Foo, Esq."], ["pic_url", ""], ["updated_at", "2015-02-12 16:08:47.838797"], ["id", 13]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
  def destroy
    @user.destroy

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
---
  def set_user
    @user = User.find(params[:id])